---
kind: method
id: M:Autodesk.Revit.DB.ElementIsElementTypeFilter.#ctor
source: html/12114f82-1a44-f250-4d82-aafda3929dbe.htm
---
# Autodesk.Revit.DB.ElementIsElementTypeFilter.#ctor Method

Constructs a new instance of a filter to match only ElementTypes.

## Syntax (C#)
```csharp
public ElementIsElementTypeFilter()
```